Repository: PREMIUM-BLACK/premium-black-payment-for-woocommerce
Catalog: src/woocommerce-gateway-premium-black/languages/wc-gateway-premium-black-*.po
Languages: de_de, es_es

source: Payment was confirmed by Premium Black.
de_de: Bezahlung wurde von Premium Black bestätigt.
es_es: El pago fue confirmado por Premium Black.

source: The transaction was cancelled.
de_de: Die Transaktion wurde abgebrochen.
es_es: La transacción fue cancelada.

source: The transaction timed out.
de_de: Die Transaktion ist abgelaufen.
es_es: La transacción expiró.

source: Offers payments with crypto via Premium Black.
de_de: Ermöglicht Bezahlungen mit Krypto über Premium Black.
es_es: Ofrece pagos con criptomonedas a través de Premium Black.

source: Payment for order #%s insufficient
de_de: Unzureichende Bezahlung für Bestellung #%s
es_es: Pago insuficiente para el pedido #%s

source: We received <strong>%1$s</strong> of <strong>%2$s</strong>.
de_de: Wir haben <strong>%s</strong> von <strong>%s</strong> erhalten.
es_es: Hemos recibido <strong>%1$s</strong> de <strong>%2$s</strong>.

source: Please sent the missing amount.
de_de: Bitte sende den fehlenden Betrag.
es_es: Por favor envía la cantidad restante.

source: Click here to see the payment details again.
de_de: Klicke hier um die Bezahlinformationen erneut zu laden.
es_es: Haz clic aquí para ver los detalles del pago nuevamente.

source: Payment insufficient - waiting for remaining balance.
de_de: Zahlung nicht ausreichen, warten auf den ausgleichenden Betrag.
es_es: Pago insuficiente: esperando el saldo restante.

source: Waiting for transaction confirmation of order #%s
de_de: Warten auf Transaktionsbestätigung für Bestellung #%s
es_es: Esperando confirmación de transacción para el pedido #%s

source: Thank you for submitting your payment for order #%s.
de_de: Vielen Dank für die Übermittlung Deiner Zahlung zur Bestellung #%s.
es_es: Gracias por enviar tu pago para el pedido #%s.

source: Your transaction has been registered now and is being verified.
de_de: Deine Transaktion wurde registriert und wird nun überprüft.
es_es: Tu transacción ha sido registrada y ahora está siendo verificada.

source: We will notify you after the completion.
de_de: Wir werden Dich nach der Bestätigung benachrichtigen.
es_es: Te notificaremos una vez que se complete.

source: Payment submitted - waiting for blockchain confirmation.
de_de: Zahlung übermittelt – warte auf Bestätigung durch die Blockchain.
es_es: Pago enviado: esperando confirmación en la blockchain.

source: Awaiting crypto transaction
de_de: Warte auf Kryptotransaktion
es_es: Esperando la transacción criptográfica

source: The payment details could not be loaded. Please try reloading the page.
de_de: Die Bestelldetails konnten nicht geladen werde. Bitte lade die Seite erneut.
es_es: No se pudieron cargar los detalles del pago. Por favor recarga la página.

source: Status
es_es: Estado

source: The order has already been paid. No further action required.
de_de: Die Bestellung wurde bereits bezahlt. Es sind keine weiteren Schritte notwendig.
es_es: El pedido ya ha sido pagado. No se requiere ninguna acción adicional.

source: Please pay the following amount to the following address, if not already happend:
de_de: Bitte bezahle den folgenden Betrag auf die folgende Adresse, falls nicht bereits geschehen:
es_es: Por favor realiza el pago del siguiente monto a la siguiente dirección, si aún no lo has hecho:

source: Amount:
de_de: Betrag:
es_es: Cantidad:

source: Amount received:
de_de: Betrag erhalten:
es_es: Cantidad recibida:

source: ⚠️ Important: This payment can only be processed via the %1$s blockchain. Please ensure you send the payment from a %2$s compatible wallet.
de_de: Wichtig: Diese Zahlung kann nur über die %1$s-Blockchain verarbeitet werden. Bitte stelle sicher, dass du die Zahlung von einer mit %2$s kompatiblen Wallet sendest.
es_es: ⚠️ Importante: Este pago solo se puede procesar a través de la blockchain %1$s. Asegúrate de enviar el pago desde una wallet compatible con %2$s.

source: Address:
de_de: Adresse:
es_es: Dirección:

source: Pay now or see current status
de_de: Jetzt bezahlen/Status anschauen
es_es: Pagar ahora o ver el estado actual

source: In most cases, payments are processed immediately. In rare cases, it may take a few hours.
de_de: In den meisten Fällen werden die Zahlungen sofort bearbeitet. In seltenen Fällen kann es einige Stunden dauern.
es_es: En la mayoría de los casos los pagos se procesan de inmediato. En casos raros puede tardar unas horas.

source: The order was cancelled.
de_de: Die Bestellung wurde storniert.
es_es: El pedido fue cancelado.

source: The execution of your payment transaction is no longer possible, because your session has expired. Please create a new order.
de_de: Die Ausführung Deiner Bezahlung ist nicht länger möglich, da sie bereits abgelaufen ist. Bitte gib eine neue Bestellung auf.
es_es: La ejecución de tu transacción de pago ya no es posible porque tu sesión ha expirado. Por favor crea un nuevo pedido.

source: Pay now/See status
de_de: Jetzt bezahlen/Status anschauen
es_es: Pagar ahora / Ver estado

source: Your payment request has been approved.
de_de: Deine Bezahlung wurde bestätigt.
es_es: Tu solicitud de pago ha sido aprobada.

source: Premium Black Setup
de_de: Premium Black Bezahlmethode aktivieren
es_es: Configuración de Premium Black

source: Settings
de_de: Einstellungen
es_es: Ajustes

source: Premium Black is almost ready. To get started, fill in your API credentials to finish the installation.
de_de: Premium Black ist fast bereit. Um zu starten, trage deine API-Zugangsdaten ein, um die Installation abzuschließen.
es_es: Premium Black está casi listo. Para comenzar, completa tus credenciales API para finalizar la instalación.

source: Finish onboarding
de_de: Onboarding abschließen
es_es: Finalizar configuración

source: Premium Black Payment for WooCommerce
de_de: Premium Black Bezahlmethode für Woocommerce
es_es: Premium Black Método de Pago para WooCommerce

source: This plugin allows you to offer crypto currency payments with Premium Black.
de_de: Dieses Plugin erlaubt dir die Verwendung von Premium Black als Bezahlmethode.
es_es: Este plugin te permite ofrecer pagos con criptomonedas a través de Premium Black.
